function binaryToDecimal(binaryStr) {
    
    let decimal = parseInt(binaryStr, 2);
    console.log(decimal); 
}


binaryToDecimal("11001010"); 
//**
//                               parseInt()
//  е вградена функция, която се използва за преобразуване на стринг в цяло число. 
// Тя приема два основни аргумента 
// Mоже да се използва за преобразуване на числа от различни числови системи, като :
//  двоична, осмична, десетична и шеснадесетична. 
//**
// Приема 2 периметъра:
// 1ви -string (задължителен): Стрингът, който искате да преобразувате в цяло число.

//2ри (по избор): Базата на числовата система, в която е представено числото в стринга.
//  Това може да бъде всяко число от 2 до 36. Например:

//2: Бинарна (двойкова) система.

//10: Десетична система (най-често използваната).

//16: Шеснадесетична (хексадесетична) система. */
// 
//**!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// *Ако стрингът започва с числа, функцията ще започне да ги преобразува в цяло число.
//---------------------------------------------------------------------------------------
//Ако стрингът съдържа нецифрови символи след числата, те ще бъдат игнорирани (след първото срещнато нечислово значение).
//---------------------------------------------------------------------------------------
//Ако първият символ в стринга не е число, функцията връща NaN (Not a Number).
//  */