function calculateDistance(x1, y1, x2, y2) {
   
    let deltaX = x2 - x1;
    let deltaY = y2 - y1;

    
    let distance = Math.sqrt(deltaX * deltaX + deltaY * deltaY);
 
    console.log(distance)
}
calculateDistance(2, 4, 5, 0)


/**
 * Методът Math.sqrt() в JavaScript е част
 *  от вградената библиотека на Math и се използва
 * за изчисляване на квадратния корен на число. 
 * 
 * Квадратният корен на дадено число е число, което, 
 * когато се умножи само за себе си, дава оригиналното число.
 * 
 *  Например, квадратният корен на 9 е 3, защото 
     3×3=9
-------------------------------------
Отрицателно × отрицателно = положително

Положително × положително = положително

Отрицателно × положително = отрицателно

Положително × отрицателно = отрицателно
 
--------------------------------
 * Стъпки за изчисляване на разстоянието:
 * 
Намери разликата между x-координатите:
Това е разстоянието между точките по хоризонталната ос. 
Изваждаш x-координатата на втората точка от x-координатата на първата точка.
          5−2=3


Намери разликата между y-координатите:
Това е разстоянието между точките по вертикалната ос.
 Изваждаш y-координатата на втората точка от y-координатата на първата точка.
0−4=−4


Вземи квадратите на тези разлики:
За да се уверим, че разстоянието няма да е отрицателно, 
взимаме квадратите на разликите, които сме намерили:


3×3=9

(−4)×(−4)=16

Сумирай тези квадрати:
Сега събираш резултатите от квадратите: 

9+16=25

Вземи квадратния корен на сумата:
Накрая взимаш квадратния корен от 25, за да намериш истинското разстояние: 
 25=5

 * 
 * 
 * 
 */